Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c

/***********************************************************************/
/*                                                                     */
/*  FILE        : PLC_iSW_light.                                       */
/*  DATE        : Wed, January 09, 2013                                */
/*  DESCRIPTION : Main Program                                         */
/*  CPU TYPE    : MSP430G2553                                          */
/*  PROJECT     : PLC Switch                                           */
/*  AUTHOR      : Suilarso Japit                                       */
/*  VERSION     : 90?.001.1-000 (Should be 909)                        */
/*  HISTORY     :                                                      */
/*    SJ1031212 - Start software development activity.                 */
/*    SJ4061212 - Modify code; Remove network initialisation;          */
/*                DIP switch is working and able to control light.     */
/*    SJ5071212 - Experiment random generator using current or voltage */
/*                data input from ADC channel.                         */
/*    SJ2181212 - Make a backup under scarlet prototype folder.        */
/*    SJ3191212 - Implement codes to allow toggle function of a same   */
/*                button being pressed twice.                          */
/*    SJ5211212 - Write codes to implement master on/off key.          */
/*    SJ5040113 - Implement system reset when command 0x20 is          */
/*                received. short_address=0, Room_ID=0, scene[]=0xFF,  */
/*                and gswitch_open[]=0xFF before writing to flash.     */
/*                Then issue watchdog to initiate system reset.        */
/*      ----------All above comments remain relevant----------         */
/*    SJ3090113 - Using existing switch project and split the project  */
/*                into two parts: iSW_cntrl represents switch device   */
/*                and iSW_light represents lighting device.            */
/*    SJ3090113 - Start software development activity.                 */
/*    SJ2150113 - Complete implementation for extended scene.          */
/*                PLC_iSW_light project created.                       */
/*    SJ3160113 - Test run extended scene on actual hardware.          */
/*                All logic is working as expected.                    */
/*    SJ2220113 - Backup code to MSP430G2553_PLC_iSW_light_ORG. This   */
/*                set of code contains original DALI short address,    */
/*                before work is done to extend address to two bytes.  */
/*    SJ2190213 - Append infoC to infoD at location 32. Codes before   */
/*                merged is backup to SD card only.                    */
/*    SJ2260213 - Include verification of protocol and data structure  */
/*                version before carry out command execution.          */
/*    SJ3170413 - Hard coded fade_time global variable to 1 to         */
/*                facilitate gradual decrease in light intensity when  */
/*                the light PWM is adjusted downward.                  */
/*    SJ4230513 - Introduce DEV_7 macro for compilation of remote      */
/*                on off project. This code can turn on light 100% or  */
/*                off the light; it does not have the capability to do */
/*                PWM. Name this project as device type 7.             */
/*                Remark out DEV_7 macro when doing compilation for    */
/*                device type 6 project.                               */
/*    SJ4180713 - When UART ISR finish reading a packet, disable the   */
/*                interrupt enable flag; and re-enable the interrupt   */
/*                flag once the processing of the current packet is    */
/*                complete. The purpose of this fix is the attempt the */
/*                hang issue when packet is being send continously.    */
/*                Use UART_ISSUE macro to controll compilation. If the */
/*                fix is not solving the issue, remark the macro and   */
/*                re-compile.                                          */
/*    SJ2011013 - Add sttmt to re-activate watchdog timer after        */
/*                Expanded scene is being added or removed.            */
/*                Without this the LED light will not change state as  */
/*                there is no PWM generating necessary signal.         */
/*    SJ3091013 - Backup codes to MSP430G2553_PLC_iSW_cntrl_3091013    */
/*                before experiment for continuous press is being      */
/*                carried out.                                         */
/*    SJ5111013 - All commands related to grouping are made to react   */
/*                at one command instead of two consecutive commands.  */
/*                                                                     */
/*  U9 - L68-C20001-L00 - LF Control Board                             */
/*  H55-E30011-A42 / L68-C20001-L00 / L70-C20001-000                   */
/*  Version: 90?.001.1-000                                             */
/***********************************************************************/

//#include   <msp430x16x.h>
//#include   <msp430x23x2.h>    //"msp430x21x1.h"
#include   <msp430G2553.h>
#include   <stdlib.h>  //SJ5301112 - Need rand() and srand(seed) prototype.
//#include   <stdio.h>
#include   <string.h>

//#include   "gp_io.h"
#include   "PLC_Comm.h"
#include   "global_var.h"
#ifdef FLASH_COMPONENT
#include   "flash_module.h"
#endif


#define PRODUCT_CODE  (90?)
#define CUST_ID_CODE  (001)
#define RELEASE_CODE  (1)
#define VERSION_CODE  (000)


#define DATA_BUFFER_LEN     10


//=== SJ5060712 - External variables ==========================================
//I2C_routine.c

//dali.c
extern const unsigned char version_number;
extern const unsigned char device_type;
extern const unsigned char phys_min_lvl;

extern unsigned char power_on_level;
extern unsigned char actual_level;
extern unsigned char random_address_byte_h;
extern unsigned char random_address_byte_m;
extern unsigned char random_address_byte_l;
extern unsigned char system_failure_level;
extern unsigned char min_level;
extern unsigned char max_level;
extern unsigned char fade_rate;
extern unsigned char fade_time;
//SJ2220113 - SJEXT_ADDR: Use below declaration
#ifdef SJEXT_ADDR
  extern unsigned int  short_address;
#else  //SJ3200213 - ORG
  //extern unsigned char short_address;
#endif
extern unsigned char group_0_7;
extern unsigned char group_8_f;
extern unsigned char scene[16];
extern unsigned char status_information;
extern unsigned char data_transfer_register;
extern unsigned char data_transfer_register1;
extern unsigned char data_transfer_register2;


extern unsigned char flash_update_request;


//TAS3103_util.c
//=== SJ5060712 - END. External variables =====================================

//=== SJ5060712 - Functions prototype =========================================
int RetrieveFromADC(int data_format);//(void);
void AZ_Transmit_Routine(int data_type);  //SJ4221112 - Testing transmit
void AZ_Randomised_Long_Address(void);  //SJ5071212 - Generate random long address
//void UART_Rx_Acknowledgement(int validity_flag);  //SJ3010812 - 
//SJ1171212 - DO NOT REMOVE below prototype; maybe needed in non-iSwitch project
//unsigned char AZ_Acknowledge_Basenode_Request(unsigned char Message_Type);  //SJ4300812 - Response to basenode request
//void AZ_DALI_Response(int validity_flag);  //SJ3220812 - ORG. Point-to-Point
void AZ_DALI_Response(int response_type);  //SJ3220812 - Replaced. Network type
//void PWM_Selftest(void);  //SJ3080812 - 
//void PWM_Selftest_2(void);  //SJ5100812 - 
//__interrupt void ISR_Port1(void);  //SJ3150812 - Selftest
//=== SJ5060712 - END. Functions prototype ====================================


