Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
//=== SJ5060712 - External function prototype =================================
#ifdef FLASH_COMPONENT
//flash_module.c
extern void Flash_Write(unsigned int start_addr, short amount_byte, unsigned char *buffer);
#endif  //#ifdef FLASH_COMPONENT ... #endif

//PLC_Comm.c
extern unsigned char PLC_System_Init(int init_step);
extern unsigned char PLC_Network_Config(int init_step);
extern void CRC16_UpdateChecksum(unsigned short *pcrcvalue, const void *data, int length);  //SJ4130912 - 

//ISR_Routines.c
//void QuickDelay(unsigned int interval);

//Dali_HPA338.c
extern void Dali_HPA338_main(void);

//dali.c
extern void TI_DALI_Transaction_Loop(void);  //SJ4090812 - 
extern unsigned char TI_DALI_Match_Address(unsigned char address);
//extern void TI_DALI_Flash_Update(unsigned int key);
extern void TI_DALI_Flash_Update(unsigned int key, unsigned char wrt_area);  //SJ1171212 - Replaced

//command.c
//extern void SJ_Debugging_Fading(void);  //SJ5260413 - For debugging fading issue
//=== SJ5060712 - END. External functions prototype ===========================


//=== SJ5060712 - Global variable and constant declaration ====================
unsigned char ggeneral_buffer[DATA_BUFFER_SZ];  //[50];
#ifdef SWITCH_CONTROLLER
unsigned char gswitch_oper[SWITCH_OPER_SZ];  //SJ5141212 - equiv 64
#else
unsigned char gextended_scene[EXT_SCENE_SZ];  //SJ1140113 - equiv 64
#endif

//SJ3211112 - These two variables are defined for DIP switch
unsigned int DIP_switch_val;
//unsigned char sensor_mode;
//unsigned char PWM_value;

#if 0  //SJ1270812
//SJ1031011 - This table contains 10 running data for battary voltage
int gvoltage_tab[VOLTAGE_SAMPLE] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

//SJ1031011 - This table contains 10 running data for solar voltage
int gcurrent_tab[CURRENT_SAMPLE] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
#endif

STATE_STRUCT  gstate_var;
//=== SJ5060712 - END. Global variables declaration ===========================



//SJ5060712 - MCU detail:
//MSP430G2553 (RISC 16 bits)
//Flash memory size: 16KB + 256B
//Flash memory consists of main memory (8 segments of 512B), and information memory (4 segments of 64B)
//Segment Info_D = 0x1000 - 0x1039
//Segment Info_C = 0x1040 - 0x1079
//Segment Info_B = 0x1080 - 0x10BF
//Segment Info_A = 0x10C0 - 0x10FF  //SJ5141212 - Care must be exercised for using this segment
//RAM size: 512B
//Internal Frequencies up to 16 MHz
//Default master clock and sub-main clock is at 1.1 Mhz upon system power up.
//One timer: Timer A with three capture /compare registers.

//SJ1110110 - Short is 2 bytes long
//SJ1110110 - int is 2 bytes long
//SJ1110110 - long is 4 bytes long

//SJ5060712 Main routine
void main(void)
{
    //unsigned char ndx;
    unsigned char proceed_flag;

//SJ1270812    unsigned int data_len=0;
    //unsigned short temp_bit;  //SJ4221112 - Used for bit manipulation
    int init_step=SYSTEM_INIT_STEP_1;  //SJ3180712 - May skip the initialisation here
    int trial=0;  //SJ3180712 - May skip the initialisation here
    //int current_trial, current_count;
    //int i, j, k;

  #ifndef SWITCH_CONTROLLER
    unsigned int current_trial, current_count;
  #endif

    WDTCTL = WDTPW + WDTHOLD;       // disable Watchdog

    //SJ4131005 - Below two settings are used to manipulate with timer clock frequency.  
    //SJ5060712 - If timer frequency is changed here, remember to change the ADC10 as well.
    //SJ5060712 - Set clock to 8MHz.
    DCOCTL = CALDCO_8MHZ;   //SJ5300911 - CALDCO_1MHZ;
    BCSCTL1 = CALBC1_8MHZ;  //SJ5300911 - CALBC1_1MHZ;
    //DCOCTL = CALDCO_1MHZ;   //SJ1141111 - Set to 1 MHz  //CALDCO_8MHZ;
    //BCSCTL1 = CALBC1_1MHZ;  //SJ1141111 - Set to 1 MHz  //CALBC1_8MHZ;

  //SJ1060812 - Below setting is irrelevant when use TI DALI code
  #if 0//def  WITH_WDT
    //SJ5060712 - When use DCO, ACLK is 12KHz.
    //BCSCTL3 |= LFXT1S1;  //SJ5060712 - Used as ACLK for WDT+. Same effect as below sttmt
    BCSCTL3 |= LFXT1S_2;  //SJ5060712 - ACLK = VLO
  #endif


//SJ3110712 - Initialise MSP430 Registers ---------------------------------------------------------
    //SJ3110712 I/O pins initialisation. --------------------------------------
    //SJ3110712 - NOTE: Unused pins should be configured as I/O in SEL reg and out in DIR reg.
    //SJ3110712 - SELect register. 0 indicates pin is configured as gpio whereas 1 indicates peripheral.
    //SJ3110712 - DIRection register. 0 indicates pin configured as input whereas 1 indicates output.    
    //SJ3110712 - Interrupt Enable register. 0 indicates pin interrupt is disabled whereas 1 indicates enabled
    //SJ3110712 - Interrupt Edge Select register. 0 indicates raising edge whereas 1 indicates falling edge    

    //SJ3110712 - Port 1 initialisation.
    P1SEL = 0x06;  //SJ3110712 - (00000110) Pin 1(Rx), and 2(Tx) - UART Peripheral
    P1SEL2 = 0x06;  //SJ3110712 - (00000110) Pin 1, and 2 - UART Peripheral  //SJ1171212 - Without this sttmt UART will not work. WHY???
    P1DIR = 0x28;  //SJ3110712 - (00101000)
    //P1IN = 0x00;
  #ifdef RED_N_GREEN_LED
    P1OUT = 0x08;  //SJ1081012 - Turn on red LED (00001000)
  #endif
    //P1IE  = 0x80;  //SJ2120411 - Pin 7 is interrupt enabled (10000000)
    //P1IES = 0x80;  //SJ2120411 - Pin 7 is set to 1 to set falling edge (10000000)

    //SJ5051012 - Port 2 initialisation
    P2SEL = 0x04;  //SJ5051012 (00000100) Pin 2 - PWM, The rest of the pins as GPIO.
    //P2SEL2 = 0x00;  //SJ5071212 - DO NOT USE this statement
    P2DIR = 0x0F;  //SJ5051012 - (00001111)
    //P2IN = 0xF0;  //SJ5051012 - (11110000) PCB with DIP switch  //SJ1261112 - SJTODO
    //P2OUT = 0x07;//0x0F;  //SJ5051012 - (00000111)
    //P2IE = 0x04;
    //P2IES = 0x04;
    P2REN = 0xF0;  //SJ1081012 - Enable internal pullup for P2.4, P2.5, P2.6, and P2.7 (11110000)
    P2OUT = 0xF7;  //SJ3160113 - (11110111). Required because of internal pullup enabled.

    //SJ5051012 - Port 3 initialisation
    P3SEL = 0x00;  //SJ5051012 - (00000000) All pins as GPIO.
    //P3SEL2 = 0x00;
    P3DIR = 0x00;  //SJ5051012 - (00000000) All set as input
    //P3IN = 0xFF;   //SJ5051012 - (11111111) All set to high
    //P3OUT = 0x07;  //SJ5051012 - (00000111)
    //P3IE = 0x04;
    //P3IES = 0x04;
    P3REN = 0xFF;  //SJ1081012 - Enable all internal pullup for P3 (11111111)
    P3OUT = 0xFF;  //SJ3160113 - Required because of internal pullup enabled.


    //SJ3110712 Timers initialisation. ----------------------------------------
    //SJ3110712 - NOTE: TACTL MC_1 should not be set here. Once set timer start to tick.
    //SJ3110712 - MC_0 - Stop mode, MC_1 - Up mode, MC_2 - Continuous mode, MC_3 - Up/Down mode

    //SJ3110712 - Timer0_A2 control register initialisation.
    //SJ3110712 - Timer0_A2 is used as timer interval for ISR general routine.
    //SJ3110712 - I think this can be achieve by using Timer1_A2; share with PWM timer.
    //TACTL = TASSEL_2 + TACLR;  //SJ3110712 - SMCLK = 1MHz; ID_0 ==> 1MHz / 1 = 1MHz
    TACTL = TASSEL_2 + ID_3 + TACLR;  //SJ3110712 - SMCLK = 8MHz; ID_3 ==> 8MHz / 8 = 1MHz
    //SJ3110712 - Initialise Capture/Compare control register.
    //SJ3110712 - Capture/Compare block 0 is used as compare mode for timer.
    TACCTL0 = CCIE;

    //SJ3110712 - Timer1_A3 control register initialisation.
    //SJ3110712 - Timer1_A1 (Capture/Compare block 1) is used to generate PWM.
//SJ3220513 - Device type 7 doe not use timer.
  #ifndef DEV_7  //SJ4230513 - Not relevant for device type 7.
    //TACTL = TASSEL_2+ID_0+MC_0+TACLR;   // Timer clock = SMCLK = 8MHz  //SJ1130812 - Reference from TI DALI code
    //TA1CTL = TASSEL_2 + TACLR;  //SJ3110712 - SMCLK = 1MHz; ID_0 ==> 1Mhz / 1 = 1MHz
    TA1CTL = TASSEL_2 + ID_3 + TACLR;  //SJ3110712 - SMCLK = 8MHz; ID_3 ==> 8MHz / 8 = 1MHz
    //SJ3110712 - Initialise Capture/Compare control register.
    //SJ3110712 - Possible setting for outmode:
    //SJ3110712 - OUTMOD_1;  //SJ3110712 - Set
    //SJ3110712 - OUTMOD_2;  //SJ3110712 - Toggle/reset
    //SJ3110712 - OUTMOD_3;  //SJ3110712 - Set/reset
    //SJ3110712 - OUTMOD_4;  //SJ3110712 - Toggle
    //SJ3110712 - OUTMOD_5;  //SJ3110712 - Reset
    //SJ3110712 - OUTMOD_6;  //SJ3110712 - Toggle/set
    //SJ3110712 - OUTMOD_7;  //SJ3110712 - Reset/set
    TA1CCTL1 |= OUTMOD_3;//OUTMOD_6;  //SJ3110712 - Toggle/set
  #endif

    //SJ3110712 UART initialisation. ----------------------------------------
    //SJ3110712 - NOTE: - Below notes extract from TI document
    //SJ3110712 - Note: Initializing or Re-Configuring the USCI Module
    //SJ3110712 - The recommended USCI initialization/re-configuration process is:
    //SJ3110712 - 1) Set UCSWRST (BIS.B #UCSWRST,&UCAxCTL1)
    //SJ3110712 - 2) Initialize all USCI registers with UCSWRST = 1 (including UCAxCTL1)
    //SJ3110712 - 3) Configure ports.
    //SJ3110712 - 4) Clear UCSWRST via software (BIC.B #UCSWRST,&UCAxCTL1)
    //SJ3110712 - 5) Enable interrupts (optional) via UCAxRXIE and/or UCAxTXIE

    //UCA0CTL0;  //SJ2100712 - No need to set; all default value meet our requirement. For future use, may consider UCMODE2.
    UCA0CTL1 = UCSWRST;  //SJ2100712 - Step 1
    UCA0CTL1 |= UCSSEL1; //SJ2100712 - Step 2 
    UCA0BR0 = 0x08;        //SJ2100712 - Refer to Tab 15-5 of MSP430 user manual.
    UCA0BR1 = 0x00;        //SJ2100712 - Refer to Tab 15-5 of MSP430 user manual.
    UCA0MCTL = 0xB0+UCOS16;//SJ2100712 - Refer to Tab 15-5 of MSP430 user manual. UCBRFx=11+UCBRSx=0+UCOS16
    //SJ2010610 - Step 3 was done above in the port initialisation
    UCA0CTL1 &= ~UCSWRST;  //SJ2100712 - Step 4
//SJ4221112 - Below sttmt is commentted out for debugging purpose. Uncomment it after use
    UC0IE |= UCA0RXIE;  //SJ2100712 - Step 5 (Set on rx interrupt in IE2 register)  //SJ3110712 - Check if this sttmt can be here??

    //SJ3110712 ADC initialisation. -----------------------------------------

    //SJ3110712 - ADC10 control register initialisation.
    ADC10AE0 |= 0xC0;  //SJ3110712 - Assign P1.6 (A6), and P1.7 (A7) as analog input to ADC. (11000000)
    //ADC10CTL0 = SREF_1 + ADC10SHT_3 + REF2_5V + REFON + ADC10ON;  //SJ4210110 - For testing temperature.
    //ADC10CTL1 = INCH_0 + ADC10DIV_3;            // Repeat single channel, A0
    //ADC10SA = 0x200;   //SJ3130110 - This reg contains ram addrs for data transfer.
    //ADC10DTC1 = 0x20;  //32 conversions  //SJ3130110 - I believe this reg is used for multiple conversion.

    _BIS_SR(GIE);  //SJ1130812 - Enable interrupt. equiv __enable_interrupt();?????
//SJ3110712 - End of MSP430 Registers Initialisation. ---------------------------------------------

//SJ3110712 - Initialize global var. --------------------------------------------------------------
//gstate_var.sj_ndx=0;
    gstate_var.protocol_ver = 0x00;     //SJ2260213 - Protocol version
    gstate_var.data_struct_ver = 0x00;  //SJ2260213 - Data structure version
    //gstate_var.PLC_status = SJ_FAIL;
    gstate_var.general_ctrl_flag = 0;
    //gstate_var.general_delay = TIMER_1_SECOND;  //SJ1040411 - Renamed
    gstate_var.general_delay = 10;  //SJ4110413 - Reduced to 500 msecs
    gstate_var.error_delay = 0;  //SJ2110912 - 
    gstate_var.UART_Rx_ndx = 0;
    gstate_var.UART_Rx_State = UART_INVALID;
    //gstate_var.UART_Rx_timeout = 0; //MESSAGE_HEADER_LEN;  //SJ3180712 - Min. bytes read are 8 bytes of header
    gstate_var.DALI_response = 0;  //SJ1170912 - 
    //gstate_var.sensor_state = OFF_STATE;  //SJ3121212 - Not used in iSwitch project
  #ifdef RED_N_GREEN_LED
    //gstate_var.red_led_timer = 0;
    //gstate_var.green_led_timer = 0;
    gstate_var.led_blink_freq = 0;  //SJ3191212 - Replaced above two sttmts
  #endif
  #if 0  //SJ4041012 - Testing broadcast from service node
    gstate_var.broadcast_mode = 0x00;
    gstate_var.broadcast_delay = TIMER_20_SECONDS;
  #endif
//gstate_var.wdt_flag = 1;
    //gstate_var.led_timer = 0;  //SJ3290513 - Not used for now. It will be used if device is installed with sensor.
    //gstate_var.flash_update_countdown = 0;  //SJ2110912 - Countdown to flash update  //SJ3191212 - KIV
    gstate_var.UART_Rx_threshold = 0;  //SJ4291112 - Solving out of sync state
    gstate_var.UART_Rx_duration = 0;
    gstate_var.Rx_payload_len = 0;  //SJ2170712 - SJNOTE: May not be needed
    //gstate_var.PAN_ID = 0x0000;   //SJ3191212 - Not used so far. DO NOT REMOVE
    //gstate_var.coord_addr = 0x0000;  //SJ4260712 - DO NOT REMOVE
    //gstate_var.network_addr = 0x0000;  //SJ3191212 - Can be removed and replaced with local var.
    gstate_var.Room_ID = 0x0000;  //SJ1101212 - Room ID
    gstate_var.prev_key = 0;

    //gstate_var.cum_current = 0;//CONST_1_44_VOLT * CURRENT_SAMPLE;
    gstate_var.LED_current = 0;
    gstate_var.LED_voltage = 0;
    //gstate_var.sensor_signal = 0;  //SJ3121212 - Not used in iSwitch project
    //gstate_var.device_state_flag.com_field.BYTE = 0;  //SJ3200411 - Added
    //gstate_var.GEN_ctrl_flag.com_field.BYTE = 0;
//SJ3110712 - End of global var initialisation ----------------------------------------------------

//SJ3110712 - Access to flash memory --------------------------------------------------------------
//SJ3110712 - End of Access to flash memory -------------------------------------------------------


//SJ4090812 - Start timer -------------------------------------------------------------------------
    TACCR0 = TIMER_CONST;  //SJ1110411 - Init compare reg with value.  //SJ1110411 - 0xC350 = 50000 base 10
    TACTL = TACTL | MC_1;  //SJ1110411 - Start timer in up mode.
    //TA1CCR2 = TIMER_CONST;  //SJ3110712 - DO NOT REMOVE.
    //--- SJ3110712 - Timer is active beyond this point ---------------------------------

#if 0  //SJ1191112 - Re-instate //SJ5310812 - Skip this as they are done in DALI initialisation.
    P2OUT |= 0x08;  //SJ3281112 - Purely for debugging only
    __no_operation();
    __no_operation();
    __no_operation();
    PWM_PERIOD_REG = PWM_PERIOD;  //SJ1191112 - PWM_PERIOD = 5000  //SJ3281112 - TA1CCR0
    DUTY_CYCLE_REG = 5000;//PWM_0_PERCENT;  //SJ1191112 - Maybe need to refer to array. For reference see Dali_HPA338_main() - TA1CCR1
    //SJ2020210 - MC_1 - Up mode, MC_2 - Continuous mode, MC_3 - Up/Down mode
    TA1CTL |= MC_1;  //SJ3110712 - Up
    //--- SJ3110712 - PWM are active beyond this point ----------------------------------
#endif

    //--- SJ4290710 - This code is to introduce delay to allow MCU2 to stabalise ---
    while (gstate_var.general_delay) ;

