Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
    //SJ1081012 - Turn on red LED here
    //P1OUT |= ON_RED_LED;  //SJ1081012 - Done during port initialisation

    Dali_HPA338_main();

#if 0  //SJ5260413 - For debugging fading issue
    SJ_Debugging_Fading();
#endif


#ifdef WITH_PLC
  #if 1
    status_information |= BIT2;  //SJ4300812 - Turn on arc power - #define LAMP_ARC_POWER_ON  BIT2
  #endif

//SJ3180712 - PLC system initialization. ----------------------------------------------------------

  #ifdef RED_N_GREEN_LED  //SJ1081012 - Start blinking red LED
    //gstate_var.red_led_timer = BLINK_FREQ_250_MS;  //SJ3191212 - ORG
    gstate_var.led_blink_freq = LED_BLINK_FREQ;
    gstate_var.general_ctrl_flag |= RED_LED_BLINK_ON;
  #endif

    init_step = SYSTEM_INIT_STEP_1;
    trial = 0;
    while (init_step < SYSTEM_INIT_END && trial < MAX_RETRIAL)  //SJ3180712 - 1 trial only
    {
        proceed_flag = PLC_System_Init(init_step);

        if (proceed_flag == SJ_PASS)
        {
            init_step++;
            trial = 0;

            //gstate_var.general_delay = TIMER_2_SECONDS;  //SJ4230812 - Delay 2 seconds before retrial
            gstate_var.general_delay = 5;  //SJ1270812 - Delay 250 micro seconds before going to next phase
            while (gstate_var.general_delay) ;
        }
        else
        {//SJ1270812 - Temporary solution, once there are LEDs indicator in the hardware, use LED to indicate initialisation status.
            //gstate_var.general_delay = TIMER_2_SECONDS;  //SJ4230812 - Delay 2 seconds before retrial
            //while (gstate_var.general_delay) ;
            trial++;
        }
    }

    //SJ1191112 - No need this delay in this project.
    //SJ1191112 gstate_var.general_delay = TIMER_2_SECONDS;
    //SJ1191112 while (gstate_var.general_delay) ;  //SJ1160712 - Delay two seconds before returning.

    //init_step = NETWORK_INIT_SET_INFO_1;
    gstate_var.PLC_status = 0;
    if (proceed_flag == SJ_FAIL)
    {
      #if 1  //SJ5071212 - This will reset system
        //SJ1191112 - System initialization fail, can't proceed to next stage.
        //SJ3250712 - What does the system do next? Reset and retry, or proceed? - At the moment chose to Reset.
        //P2OUT = 0x07;//0x0F;
        BCSCTL3 |= LFXT1S_2;  //SJ5060712 - ACLK = VLO
        WDTCTL = WDT_ARST_1000;  //SJ4230812 - For development use only. Remove after that.
        while (1);
      #else  //SJ5071212 - This will by-pass system reset
        ;
      #endif
    }
  #ifdef RED_N_GREEN_LED
    else
    {
        //SJ2091012 - Stop blinking
        gstate_var.general_ctrl_flag &= RED_LED_BLINK_OFF;
        //gstate_var.red_led_timer = 0;  //SJ3191212 - ORG
        gstate_var.led_blink_freq = 0;

        //SJ4061212 - Turn off red and on green LED
        P1OUT &= OFF_RED_LED;  //SJ1081012 - Turn off red LED
        P1OUT |= ON_GREEN_LED;  //SJ4291112 - Turn on green LED
    }
  #endif

#endif  //SJ2310712 - #ifdef WITH_PLC ... #endif


//SJ4090812 - DALI Initialisation -----------------------------------------------------------------
//SJ5071212 - DALI initialisation is moved up before modem configuration

    //gstate_var.general_delay = TIMER_1_SECOND;
    //while (gstate_var.general_delay) ;

    //--- SJ1031011 - At this point, both LED_current and LED_voltage would have -----
    //--- SJ1031011 - cum 40 data each. 1 sec 20 ISR, 2 sec 40 ISR entries. -------------
    //--- SJ1031011 - Potential issue: the first 10 data is not so accurate -------------

    gstate_var.UART_Rx_State = UART_STANDBY;  //SJ2310712 - New method

  #ifndef SWITCH_CONTROLLER
    current_trial = 0;
    current_count = 0;
  #endif

    //SJ3211112 - Retrieve device address from DIP switch
    //short_address = 0;  //SJ3211112 - This may not be needed.  //SJ2220113 - SJEXT_ADDR: If needed, becareful
    //DIP_switch_val = P3IN & 0x3F;  //SJ3211112 - Bit 0 to 5 contain dev addr (00111111)
    //DIP_switch_val = 0x06;  //SJ2271112 - For debugging purpose. Set the device to be 6

    //SJ3121212 - SJTODO: At the moment just below sttmt is sufficient to return Room_ID, 
    //SJ3121212 - in future hardware, may need to change.
    gstate_var.Room_ID = ~(P3IN & 0xFF);
    gstate_var.Room_ID = gstate_var.Room_ID & 0x00FF;  //SJ3020113 - Remember to mask MSB to zero
//    if (device_type >= 11)  //SJ4131212 - This is temporay solution. REMOVE WHEN NO LONGER NEEDED
//        gstate_var.Room_ID = 0x001D;

//SJ3110712 - Main loop ---------------------------------------------------------------------------
    while(1)   //SJ5060712 - Loop forever
    {
      //SJ1060812 - TI DALI code require the use of watchdog as interval, as such below watchdog will be skipped.
      //SJ3040810 - Use watchdog timer to reset in the event of infinite loop
      #if 0//def  WITH_WDT
        //WDTCTL = WDTPW + WDTHOLD;
        //SJ3040810 - Reset watchdog timer ~ 2.5 sec. 
        WDTCTL = WDT_ARST_1000;  //SJ4050810 - equiv  (WDTPW + WDTCNTCL + WDTSSEL)
      #endif

      #if 0  //SJ1191112 - This project uses point to point connection. DO NOT REMOVE, just in case it is needed
      /*****
        //SJ4230812 - If attachment not successfull, re-do
        if (gstate_var.PLC_status < NETWORK_INIT_ATTACH)
        {
        #ifdef RED_N_GREEN_LED
            gstate_var.led_blink_freq = LED_BLINK_FREQ;
            gstate_var.general_ctrl_flag |= RED_LED_BLINK_ON;
        #endif
//SJ2220113 - SJEXT_ADDR: Not used, but if used change to (short_address & 0x00FF)
            gstate_var.UART_Rx_duration = short_address * NETWORK_DELAY_CONST;  //SJ4300812 - Beware of byte overflow
            while (gstate_var.UART_Rx_duration) ;

            init_step = gstate_var.PLC_status + 1;
            trial = 0;

            while (init_step < NETWORK_INIT_END && trial < MAX_RETRIAL)  //SJ4190712 - 1 trial
            {
                proceed_flag = PLC_Network_Config(init_step);

                if (proceed_flag == SJ_PASS)
                {
                    gstate_var.PLC_status = init_step;
                    init_step++;
                    trial = 0;
                }
                else
                    trial++;
            }

          #ifdef RED_N_GREEN_LED
            gstate_var.general_ctrl_flag &= RED_LED_BLINK_OFF;
            gstate_var.led_blink_freq = 0;
            if (gstate_var.PLC_status == NETWORK_INIT_ATTACH)
            {
                //SJ2091012 - Device is successfully attached to network. Time to turn off red LED and on green LED
                P1OUT &= OFF_RED_LED;  //SJ1081012 - Turn off red LED. 0xF7 (11110111)
                P1OUT |= ON_GREEN_LED;  //SJ2091012 - Turn on green LED. 0x20 (00100000)
            }
          #endif

