Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
            gstate_var.UART_Rx_State = UART_STANDBY;  //SJ2310712 - New method
        }
      *****/
      #endif  //SJ1191112 - #if 0 ... #endif


//SJ4061212 - Gateway to DALI transaction loop
        if (gstate_var.UART_Rx_State == UART_PROCESSING)
        {
            if (ggeneral_buffer[MSG_HEADER_TYPE] == MSG_TYPE__DATA_TRANSFER)
            {
            #ifdef AUTO_OFF
                gstate_var.max_oper_hour = 0;  //SJ3290513 - Reset counter if communication system is working fine
            #endif
                TI_DALI_Transaction_Loop();   //SJ1191112 - DALI protocol is not used in this project
                //UART_Rx_Acknowledgement(1);

                //SJ2110912 - Update to flash is requested, so start countdown.
                //*****  //SJ3211112 - If there is need for this, need to modify.
                if (flash_update_request)
                {
				  #if 0  //SJ3171012 - ORG. With delay before writing to flash
                    gstate_var.flash_update_countdown = TIMER_30_SECONDS;  //SJ2110912 - In real implemtation, change to TIMER_5_MINUTES
				  #else //SJ3171012 - Replaced. No delay, write to flash immediately
		            flash_update_request = 0;
		            //TI_DALI_Flash_Update(FWKEY);//FWKEY
		            TI_DALI_Flash_Update(FWKEY, 0);  //SJ1171212 - Replaced

                  #if 1  //SJ5071212 - This will reset system
                    //if (ggeneral_buffer[66] == 0x20)  //SJ5040113 #define  AZ_CMD_LOC  66 defined in dali.h
                    if (gstate_var.general_ctrl_flag & SYS_RESET_ON)
                    {
                        //gstate_var.general_ctrl_flag &= SYS_RESET_OFF;  //SJ5040113 - Since the system is going to reset, don't think we need this
                        BCSCTL3 |= LFXT1S_2;  //SJ5060712 - ACLK = VLO
                        WDTCTL = WDT_ARST_1000;  //SJ4230812 - For development use only. Remove after that.
                        while (1);
                    }
                  #endif

		            WDTCTL = (WDT_MDLY_8);  //SJ4200912 - FADE_INTERVAL equiv (WDT_MDLY_8 - SMCLK/8192), 1 second will goto ISR 977 times.
		            IE1 |= WDTIE;
				  #endif
                }/*****/

            }  //SJ5270712 - if (ggeneral_buffer[MSG_HEADER_TYPE] == MSG_TYPE__DATA_TRANSFER) { ... }

            gstate_var.UART_Rx_State = UART_STANDBY;  //SJ2310712 - Move down from above
#ifdef UART_ISSUE
//SJ4180713 - SJTO_TRY: Re-activate UART interrupt enable
UC0IE |= UCA0RXIE;
#endif
        }

//--- SJ4180713 - THIS LINE SERVE AS END OF while() LOOP. Adjust this line accordingly. ---------------------
//--- SJ4180713 - Codes placed below this line are meant for optional features for the project. -------------

//SJ1171212 - Don't need this if device is switch controller
#ifndef SWITCH_CONTROLLER
//SJ4061212 - Reading ADC channels for current and voltage value
        //SJ1270812 - Reading channel 6 for LED current
        if (current_count == CURRENT_SAMPLE)  //SJ2271112 - CURRENT_SAMPLE equiv 50
        {
            current_trial = current_trial / CURRENT_SAMPLE;//10;
            gstate_var.LED_current = (unsigned int) ((float) current_trial * 3.62);   //0.000362;
            current_trial = 0;
            current_count = 0;
            //SJ1100912 - New LED_current is registered here.
            //SJ1100912 - 1) If prev_level not equal to actual_level, assign actual_level to prev_level and LED_current to prev_current.
            //SJ1100912 - 2) If prev_current not equal LED_current and actual_level equal prev_level, send error packet to DC.

            //SJ2110912 - SJTODO: Don't think below if sttmt is required at the moment; if it does in the future, it can be 
            //SJ2110912 -         placed within ISR_TimerA() ISR routine.
            //SJ1170912 if (gstate_var.prev_level != actual_level)
            //SJ1170912     gstate_var.prev_level = actual_level;
                //gstate_var.prev_current = gstate_var.LED_current;

            //if (gstate_var.LED_current < gstate_var.prev_current)
            //    current_trial = gstate_var.prev_current - gstate_var.LED_current;

            if (gstate_var.error_delay == 0)
            {
              if ((gstate_var.LED_current != 0) && (gstate_var.general_ctrl_flag & BATT_MONITOR_ON))
              {
                gstate_var.general_ctrl_flag &= BATT_MONITOR_OFF;
                //AZ_DALI_Response(DEVICE_QUERY);  //SJ1270812 #define DEVICE_QUERY  2 in PLC_Comm.h  //SJ2271112 - Not used

                gstate_var.error_delay = 10;
              }
              else
              {
                //SJ1100912 - Check for possible device malfunction
                if ((gstate_var.LED_current == 0) && (actual_level != 0x00))
                {
                    //if ((current_trial > 1000) && (gstate_var.prev_level == actual_level))
                    //if ((gstate_var.LED_current == 0) && (gstate_var.prev_level == actual_level))
                    //if ((gstate_var.prev_level == actual_level) && !(gstate_var.general_ctrl_flag & BATT_MONITOR_ON))  //SJ1100912 - Alert DC
                    if (!(gstate_var.general_ctrl_flag & BATT_MONITOR_ON))  //SJ1100912 - Alert DC
                    {
                        gstate_var.general_ctrl_flag |= BATT_MONITOR_ON;
                        //AZ_DALI_Response(DEVICE_MALFUNCTION);  //SJ1100912 - #define DEVICE_MALFUNCTION 4 in PLC_Comm.h  //SJ2271112 - Not used

                        gstate_var.error_delay = 10;
                    }
                }
              }
            }  //SJ2110912 - if (error_delay == 0) { ... }
            //current_trial = 0;
            //current_count = 0;
        }
        else
        {
            ADC10CTL1 = INCH_6 + ADC10DIV_7 + ADC10SSEL_3;  //SJ4120712 - SMCLK=8MHz, ADC10DIV_7=8; 8 / 8 = 1MHz
            current_trial += RetrieveFromADC(ADC_BINARY);
            current_count++;
        }

        //SJ1270812 - Reading channel 7 for LED voltage
        trial = 0;
        ADC10CTL1 = INCH_7 + ADC10DIV_7 + ADC10SSEL_3;  //SJ4120712 - SMCLK=8MHz, ADC10DIV_7=8; 8 / 8 = 1MHz
        trial = RetrieveFromADC(ADC_BINARY);
        gstate_var.LED_voltage = (unsigned int) ((float) trial * 3.0938);
#endif  //SJ1171212 - #ifndef SWITCH_CONTROLLER ... #endif
//SJ1171212 - Don't need this if device is switch controller

#if 0  //SJ2180912 - Alert GUI of sensor being detected
        //SJ2271112 - In Micro lite project, those devices equipped with sensor will execute this
        if (gstate_var.sensor_state == ON_STATE)
        {
            if (!(gstate_var.general_ctrl_flag & SENSOR_ON))
            {
                gstate_var.general_ctrl_flag |= SENSOR_ON;
                AZ_DALI_Response(SENSOR_DETECTED);  //SJ2180912 #define SENSOR_DETECTED 7 in PLC_Comm.h
                gstate_var.led_timer = TIMER_5_SECONDS;
            }
            else
                gstate_var.led_timer = TIMER_5_SECONDS;
        }
        else
        {
            if ((gstate_var.general_ctrl_flag & SENSOR_ON) && (gstate_var.led_timer == 0))
            {
                gstate_var.general_ctrl_flag &= SENSOR_OFF;
                AZ_DALI_Response(SENSOR_DETECTED);  //SJ2180912 #define SENSOR_DETECTED 7 in PLC_Comm.h
            }
        }
#endif

