Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
#if 0  //SJ3171012 - DO NOT REMOVE. Move up to right after dali transaction
        if (flash_update_request && gstate_var.flash_update_countdown <= 5)
        {
            flash_update_request = 0;
            //TI_DALI_Flash_Update(FWKEY);//FWKEY
            TI_DALI_Flash_Update(FWKEY, 0);  //SJ1171212 - Replaced
            WDTCTL = (WDT_MDLY_8);  //SJ4200912 - FADE_INTERVAL equiv (WDT_MDLY_8 - SMCLK/8192), 1 second will goto ISR 977 times.
            IE1 |= WDTIE;
        }
#endif

//SJ3290513 - SJTODO: To Be Continued.
#ifdef AUTO_OFF
#define MAX_OPER_HOUR ((unsigned long) 0x1A5E00)  //SJ3290513 - equiv 1728000
        if (gstate_var.max_oper_hour > MAX_OPER_HOUR)
        {
          #ifndef DEV_7  //SJ4230513 - If device type is not 7.
            if (actual_level != OFF)
            {
                IE1 &= ~WDTIE; /* Critical update */
                actual_level=OFF;
                status_information &= ~(FADE_RUNNING+LAMP_ARC_POWER_ON);
                status_information &= ~(LIMIT_ERROR+STATUS_POWER_FAILURE);
                IE1 |= WDTIE;
                TI_DALI_Update_Callback();
            }
            //SJ3220513 - Above codes is being replaced with codes meant for device type 7
          #else
            P2OUT &= 0xF7;  //SJ3220513 - RELAY_ACCTRL off, P2.3 (11110111)
          #endif
        }
#endif

    }   //SJ5300911 while(1) { ... }
//SJ3110712 - End of Main loop --------------------------------------------------------------------

}  //SJ5060712 - End of main(void) { ... }



#if 0  //SJ5060712
//if (gstate_var.GEN_ctrl_flag.com_field.BYTE & NEW_DATA_ON)
//gstate_var.GEN_ctrl_flag.com_field.BYTE &= NEW_DATA_OFF;
//gstate_var.GEN_ctrl_flag.com_field.BYTE &= BLINK_LED_OFF;  //SJ5300911 - At the moment just this is enough. If more flags are used, need to revise
//switch (oper_mode)
//{
//}  //SJ5300911 - switch (oper_mode) { ... }
//_BIS_SR(LPM3_bits + GIE);     //SJ4101111 - Enter LPM3 mode. CPU, MCLK, SMCLK all set to off
//IE1 &= ~WDTIE;  //SJ4101111 - Disable WDT interrupt
//WDTCTL = WDT_ARST_1000;  //SJ4101111 - Put back to watchdog mode - (WDTPW + WDTCNTCL + WDTSSEL)
//while (1) ;  //SJ4101111 - Auto reset
//(gstate_var.GEN_ctrl_flag.com_field.BYTE & NEW_DATA_ON)  //SJ5281011 - For reference only
//gstate_var.GEN_ctrl_flag.com_field.BYTE &= NEW_DATA_OFF; //SJ5281011 - For reference only
#endif


//SJ4040310 - Retrieve from ADC and convert its output to signed integer
int RetrieveFromADC(int data_format)//(void)
{
    int temp_adc;

    //ADC10CTL0 &= ~ENC;  //SJ1010310 - Moved up from below

/*****
SREF_0: (VR+ = AVCC   and VR- = AVSS)
SREF_1: (VR+ = VREF+  and VR- = AVSS)
SREF_2: (VR+ = VEREF+ and VR- = AVSS)
SREF_4: (VR+ = AVCC   and VR- = VREF-/VEREF-)
SREF_5: (VR+ = VREF+  and VR- = VREF-/VEREF-)
SREF_6: (VR+ = VEREF+ and VR- = VREF-/VEREF-)
*****/

    //SJ1150310 - ADC10SHT_2 Sample 16 while ADC10SHT_3 Sample 64. 
    //ADC10CTL0 = SREF_0 + ADC10SHT_2 + ADC10SR + ADC10ON + ENC + ADC10SC;  //SJ1110411 - (SREF_0: VR+ = AVCC and VR- = AVSS)
    //ADC10CTL0 = SREF_1 + ADC10SHT_2 + ADC10SR + REF2_5V + REFON + ADC10ON + ENC + ADC10SC;  //SJ2110510 - Using 2.5 volts  //SJ1031011 - 
  #if 0  //SJ5170812 - ORG
    ADC10CTL0 = SREF_6 + ADC10SHT_2 + ADC10SR + ADC10ON + ENC + ADC10SC;  //SJ1031011 - (SREF_6: VR+ = VEREF+ and VR- = VREF-/VEREF-)
  #else  //SJ5170812 - Replaced
    ADC10CTL0 = SREF_2 + ADC10SHT_2 + ADC10SR + ADC10ON + ENC + ADC10SC;  //SJ1031011 - (SREF_2: VR+ = VEREF+ and VR- = AVSS)
  #endif

    while (ADC10CTL1 & ADC10BUSY);  //SJ4050810 - NOTE: Do we need to reset WDT+ counter here???
    temp_adc = ADC10MEM;
    ADC10CTL0 &= ~ENC;

    if (data_format == ADC_TWO_COMPLEMENT)
    {
        if (temp_adc & 0x8000)  //SJ5260210 - If true, negative value
        {
            temp_adc = ~temp_adc;
            temp_adc = ((temp_adc >> 6) + 1) * (-1);
        }
        else
        {
            temp_adc = (temp_adc >> 6);
        }
    }

    return (temp_adc);

}  //SJ4040310 - End of RetrieveFromADC()


//================================================
#if 1
//SJ5071212 - This function is used to generate randomised long address. (24 bits)
void AZ_Randomised_Long_Address(void)
{
    //unsigned char ret_flag=SJ_FAIL;
    //unsigned char temp_byte=0;
    int seed=0;
    //int trial;
    int *PtrIntFlash;

//SJ2220113 - SJEXT_ADDR: Used below sttmt for DALI extended address
#ifdef SJEXT_ADDR
    if (short_address == 0)
#else  //SJ3200213 - ORG
    if (short_address == 0x00)  //SJ5071212 - This indicated device has not been assigned with short addr yet
#endif
    {
        //ADC10CTL1 = INCH_7 + ADC10DIV_7 + ADC10SSEL_3;  //SJ4120712 - SMCLK=8MHz, ADC10DIV_7=8; 8 / 8 = 1MHz
        //seed = RetrieveFromADC(ADC_BINARY);
        seed = TAR;  //SJ5071212 - Use timer counter, above method use ADC data

        if (seed == 0)
        {
            PtrIntFlash = (int *) 0x10C0;
            seed = (int) (*PtrIntFlash);
            seed = (seed & 0xFF00) >> 8;
        }

        srand(seed);
        random_address_byte_h = rand();
        random_address_byte_m = rand();
        random_address_byte_l = rand();

        //temp_byte = seed & 0x00FF;
        gstate_var.DALI_response = (seed & 0x00FF) + 70;

        flash_update_request = 1;

    }  //SJ5071212 - if (short_address == 0x00) { ... }

    //return (ret_flag);

}  //SJ5071212 - End of AZ_Randomised_Long_Address()
#endif
//================================================


//SJ4160812 - This function is used to send device current and voltage to GUI
void AZ_DALI_Response(int response_type)
{
//SJ3130313    unsigned char temp_msg_type;
//SJ3130313    unsigned int temp=0;
    int i, j, k;
    //int temp_ADC;
    //unsigned int ndx=10;

#ifdef RED_N_GREEN_LED  //SJ2091012 - Start blinking green LED
    //gstate_var.green_led_timer = BLINK_FREQ_250_MS;  //SJ3191212 - ORG
    gstate_var.led_blink_freq = LED_BLINK_FREQ;
    gstate_var.general_ctrl_flag |= GRN_LED_BLINK_ON;
#endif

    ggeneral_buffer[0] = MSG_TYPE__DATA_TRANSFER;  //SJ3220812 - Data transfer request type 0x00 i=0
    ggeneral_buffer[1] = 0x80;  //SJ4160812 - ORG=1, RPY=0, RESV=0, SEQ=0 (10000000) i=1
    ggeneral_buffer[4] = 0x00;  //SJ4160812 - Msg header CRC LSB; i=4
    ggeneral_buffer[5] = 0x00;  //SJ4160812 - Msg header CRC MSB; i=5
    ggeneral_buffer[6] = 0x00;  //SJ4160812 - Msg payload CRC LSB; i=6
    ggeneral_buffer[7] = 0x00;  //SJ4160812 - Msg payload CRC MSB; i=7
    ggeneral_buffer[8] = 0xDD;  //SJ4160812 - NSDU handle i=8
    ggeneral_buffer[9] = 0x01;  //SJ4160812 - QoS=0, SEC=0 D-route=1 i=9
    //i = 10;

	//L_SDU DATA
    ggeneral_buffer[10] = 0x60;	//IPv Version & Prority  i=10

    //flow label
    ggeneral_buffer[11] = 0x00;	//i=11
    ggeneral_buffer[12] = 0x00;	//i=12
    ggeneral_buffer[13] = 0x00; //i=13

