Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
//SJ2040912    ggeneral_buffer[14] = 0x00;	//payload length i=14
//SJ2040912    ggeneral_buffer[15] = 0x22;	//SJ3220812 - equiv 34 i=15

    ggeneral_buffer[16] = 0x11;	//next header i=16
    ggeneral_buffer[17] = 0x08;	//Hop limit i=17

    //SJ3220812 - Source IPv6 address
    ggeneral_buffer[18] = 0xfe;	//i=18
    ggeneral_buffer[19] = 0x80;	//i=19
    ggeneral_buffer[20] = 0x00;	//i=20
    ggeneral_buffer[21] = 0x00;	//i=21
    ggeneral_buffer[22] = 0x00;	//i=22
    ggeneral_buffer[23] = 0x00;	//i=23
    ggeneral_buffer[24] = 0x00;	//i=24
    ggeneral_buffer[25] = 0x00;	//i=25
    ggeneral_buffer[26] = 0x01;//(gstate_var.PAN_ID >> 8);	//SJ1101212 - Need to change to Room ID (MSB) i=26
    ggeneral_buffer[27] = 0x01;//(gstate_var.PAN_ID & 0x00FF); //SJ1101212 - Need to change to Room D(LSB) i=27
    ggeneral_buffer[28] = 0x00;	//i=28
    ggeneral_buffer[29] = 0xff;	//i=29
    ggeneral_buffer[30] = 0xfe;	//i=30
    ggeneral_buffer[31] = 0x00;	//i=31
    ggeneral_buffer[32] = 0x00;//(gstate_var.network_addr >> 8);	//SJ1101212 - TAKE NOTE short address (MSB) i=32
    ggeneral_buffer[33] = 0x00;//(gstate_var.network_addr & 0x00FF);	//SJ1101212 - TAKE NOTE short address (LSB) i=33

	//SJ3220812 - Destination IPv6 address
	//the order is swapped based on 2-byte (word)
    ggeneral_buffer[34] = 0xfe;	//i=34
    ggeneral_buffer[35] = 0x80;	//i=35
    ggeneral_buffer[36] = 0x00;	//i=36
    ggeneral_buffer[37] = 0x00;	//i=37
    ggeneral_buffer[38] = 0x00;	//i=38
    ggeneral_buffer[39] = 0x00;	//i=39
    ggeneral_buffer[40] = 0x00;	//i=40
    ggeneral_buffer[41] = 0x00;	//i=41
    ggeneral_buffer[42] = 0x01; //(gstate_var.PAN_ID >> 8);	//SJ1101212 - Need to change to Room ID (MSB) i=42
    ggeneral_buffer[43] = 0x01; //(gstate_var.PAN_ID & 0x00FF); //SJ1101212 - Need to change to Room ID(LSB) i=43
    ggeneral_buffer[44] = 0x00;	//i=44
    ggeneral_buffer[45] = 0xff;	//i=45
    ggeneral_buffer[46] = 0xfe;	//i=46
    ggeneral_buffer[47] = 0x00;	//i=47
    ggeneral_buffer[48] = 0x00;	//SJ3220812 - source short address (MSB) i=48
    ggeneral_buffer[49] = 0x00;	//SJ3220812 - source short address (LSB) i=49

	//SJ3220812 - UDP
    ggeneral_buffer[50] = 0x00;	//SJ3220812 - source port (MSB) i=50
    ggeneral_buffer[51] = 0x00;	//SJ3220812 - source port (LSB) i=51

    ggeneral_buffer[52] = 0x00;	//destination port i=52
    ggeneral_buffer[53] = 0x00;	//i=53

//SJ1030912    ggeneral_buffer[54] = 0x00;  //length in hex i=54
//SJ1030912    ggeneral_buffer[55] = 0x0E;  //0x10;  //SJ3220812 - THIS NEED TO CHANGE. Reflect the lenght of UDP packet i=55

    ggeneral_buffer[56] = 0x00;	//CRC16 i=56
    ggeneral_buffer[57] = 0x00;	//i=57

	//data length
    ggeneral_buffer[58] = 0x00;	//SJ2040912 - RESERVED. Reflect the lenght of data to send i=58
    ggeneral_buffer[59] = 0x00;	//i=59
    ggeneral_buffer[60] = 0x00; //i=60
    ggeneral_buffer[61] = 0x00; //i=61

    ggeneral_buffer[62] = (gstate_var.Room_ID >> 8); //& 0xFF00) >> 8;  //SJ1101212 - Room ID (MSB) i=62
    ggeneral_buffer[63] = (gstate_var.Room_ID);// & 0x00FF);  //SJ1101212 - Room ID (LSB) i=63

//==================================================
//SJ!!!! ggeneral_buffer[14] = 0x00;  //payload length
//SJ!!!! ggeneral_buffer[15] = 0x14;  //IPv6 payload Length, match with byte 55
    //length in hex, 2 bytes [54][55]
//SJ!!!! ggeneral_buffer[54] = 0x00;  //length in hex
//SJ!!!! ggeneral_buffer[55] = 0x14;  //start from byte 50 (after ipv6 address)
//==================================================

//--- SJ4131212 - Start of switch ---
    switch (response_type)
    {
/*****
  #if 0  //SJ4201212 -
      case REVEAL_DALI_ADDRESS:
        i = 64;
        break;
  #endif

  #if 0
      case DEVICE_QUERY:
        i = 70;
        break;
  #endif

  #if 0  //SJ5070912 -
      case GENERIC_QUERY:  //#define GENERIC_QUERY  3
        i = 78;  //SJ1170912 -
        break;
  #endif

  #if 0  //SJ5070912 -
      case DEVICE_MALFUNCTION:  //#define DEVICE_MALFUNCTION  4
        i = 64;
        break;
  #endif
*****/
  #ifdef SWITCH_CONTROLLER  //SJ2181212 - If device type is switch
      case  10:  //SJ2181212 - #define AZ_PROPRIETARY_CMD  0x0A in command.h
        //SJ2181212 - UDP data at location 50 up to 63 already define above. (Total 14 bytes excluding subsequent data)
        ggeneral_buffer[14] = 0x00;	//payload length i=14
        ggeneral_buffer[15] = 0x14;	//SJ4130912 - equiv 18 i=15

	    ggeneral_buffer[54] = 0x00;  //length in hex i=54
        ggeneral_buffer[55] = 0x14;  //SJ4130912 - THIS NEED TO CHANGE. Reflect the lenght of UDP packet i=55

        //ggeneral_buffer[62] = (gstate_var.Room_ID & 0xFF00) >> 8;//0x00;  //SJ1101212 - Room ID (MSB) i=62
        //ggeneral_buffer[63] = (gstate_var.Room_ID & 0x00FF);//0x00;  //SJ1101212 - Room ID (LSB) i=63
//SJ2220113 - SJEXT_ADDR: Not used at the moment, if needed change accordingly
//SJ4210213 - SJEXT_ADDR: loc [64] not use because command is broadcast address
        ggeneral_buffer[64] = 0x00;  //SJ1101212 - short address (MSB) i=64
        ggeneral_buffer[65] = 0xFF;//short_address;  //SJ4130912 - Dali short address i=65

//SJ2150113 - ORG        ggeneral_buffer[66] = gswitch_oper[DIP_switch_val-1];  //SJ4130912 - #define QUERY_RANDOM_ADDR_H 194 defined in command.h i=66
        ggeneral_buffer[67] = 0x00;  //SJ4130912 - i=67
        ggeneral_buffer[68] = 0x00;  //SJ4130912 - i=68
        if (gstate_var.prev_key == 0)
        {
          //SJ5211212 - If button is programmed to turn on, off it here
          if (gswitch_oper[DIP_switch_val-1] == 0x05)  //SJ5211212 - #define RECALL_MAX_LEVEL 0x05 in command.h
          {
            ggeneral_buffer[66] = 0x00;
          }
          else
          {
            ggeneral_buffer[66] = 0x0A;  //SJ3191212 - Introduce to allow toggle function of the same key pressed twice
            ggeneral_buffer[67] = 0x10;  //SJ4130912 - i=67  //SJ4201212 - #define AZ_EXT_CMD_REVERSE 0x10 defined in command.h
            ggeneral_buffer[68] = gswitch_oper[DIP_switch_val-1];  //SJ4130912 - i=68  //SJ4201212 - Decide if we need to substract 1.
          }  //SJ5211212 - if (gswitch_oper[DIP_switch_val-1] == 0x05) { ... } else { ... }
        }
        else
        {
            //SJ2150113 - If scene value is above 31, need to send packet with proprietary command
            if (gswitch_oper[DIP_switch_val-1] > (AZ_EXT_SCENE_32-1))  //SJ2150113 #define AZ_EXT_SCENE_32 0x20 defined in global_var.h
            {
                ggeneral_buffer[66] = 0x0A;  //SJ2150113 - Introduce to allow toggle function of the same key pressed twice
                ggeneral_buffer[67] = 0xBF;  //SJ2150113 - i=67  //SJ2150113 - #define AZ_GOTO_EXP_SCENE 0xBF defined in command.h
                ggeneral_buffer[68] = gswitch_oper[DIP_switch_val-1];  //SJ2150113 - i=68
            }
            else
                ggeneral_buffer[66] = gswitch_oper[DIP_switch_val-1];
        }

        ggeneral_buffer[69] = 0x00;  //SJ4130912 - i=69
        //ggeneral_buffer[70] = 0x00;  //SJ1101212 - SJTODO: used device type global var
        i = 70;  //SJ4130912 -
        break;
  #endif

