Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
  #if 1  //SJ3190912 - Use to send scene data for scene query
      case 176:  //#define QUERY_SCENE_LEVEL_0 176 in command.h
        ggeneral_buffer[14] = 0x00;	//payload length i=14
        ggeneral_buffer[15] = 0x63;	//SJ3060313 - equiv 98 i=15

	    ggeneral_buffer[54] = 0x00;  //length in hex i=54
        ggeneral_buffer[55] = 0x63;  //SJ3060313 - THIS NEED TO CHANGE. Reflect the lenght of UDP packet i=55
//temp = short_address & 0x003F;  //
//SJ2220113 - SJEXT_ADDR: No used at the moment, if needed change accordingly.
        ggeneral_buffer[64] = (short_address >> 6);  //SJ2220113 - i=67
        ggeneral_buffer[65] = (short_address & 0x003F) << 1;  //SJ2220113 - i=68
        ggeneral_buffer[66] = response_type;  //SJ3060313 - i = 66
        ggeneral_buffer[67] = device_type;  //SJ3060313 - i = 67

        i = 68;  //SJ3060313 - 68 to 83 for scene
        j = 0;
        while (j < 16)  //SJ3060313 - scene has 16 elements
        {
            ggeneral_buffer[i] = scene[j];
            j++;
            i++;
        }
        //SJ3060313 - i should be 84 at this point
        j = 0;
        while (j < 64)  //SJ3060313 - Extended scene has 64 elements
        {
            ggeneral_buffer[i] = gextended_scene[j];
            j++;
            i++;
        }
        //SJ3060313 - i should be 148 at this point. Serve as padding
        //i = 148;  //SJ3060313 - Padding
        break;
  #endif

  #if 1
      case 128: //SJ4201212 - #define STORE_THE_DTR_AS_SHORT_ADDRESS 0x80 in command.h
      case 183: //SJ4201212 - #define PROGRAM_SHORT_ADDRESS	0xB7 in special_command.h
        ggeneral_buffer[14] = 0x00;	//payload length i=14
        ggeneral_buffer[15] = 0x14;	//SJ4201212 - equiv 20 i=15

	    ggeneral_buffer[54] = 0x00;  //length in hex i=54
        ggeneral_buffer[55] = 0x14;  //SJ4130912 - THIS NEED TO CHANGE. Reflect the lenght of UDP packet i=55

        //ggeneral_buffer[62] = (gstate_var.Room_ID & 0xFF00) >> 8;//0x00;  //SJ1101212 - Room ID (MSB) i=62
        //ggeneral_buffer[63] = (gstate_var.Room_ID & 0x00FF);//0x00;  //SJ1101212 - Room ID (LSB) i=63
//SJ2220113 - SJEXT_ADDR: Use below sttmt for DALI extended address. GUI need to change as well
    #ifdef SJEXT_ADDR
        ggeneral_buffer[64] = 0xFF;//SJ4280213 (short_address >> 8);  //SJ2220113 - short address (MSB) i=64
    #else  //SJ3200213 - ORG
//        ggeneral_buffer[64] = 0x00;  //SJ1101212 - short address (MSB) i=64
    #endif
        ggeneral_buffer[65] = 0xFF;//0x00;//SJ4280213 short_address;//0x00;  //SJ4130912 - Dali short address i=65

        //ggeneral_buffer[66] = 0xB7;  //SJ4130912 - #define PROGRAM_SHORT_ADDRESS 0xB7 in special_command.h i=66
        ggeneral_buffer[66] = response_type;  //SJ4130912 - #define PROGRAM_SHORT_ADDRESS 0xB7 in special_command.h i=66
//SJ2220113 - SJEXT_ADDR: Use below codes for DALI extended address. GUI need to change as well.
    #ifdef SJEXT_ADDR
        ggeneral_buffer[67] = (short_address >> 8);  //SJ2220113 - i=67
        ggeneral_buffer[68] = short_address;  //SJ2220113 - i=68
    #else  //SJ3200213 - ORG
        ggeneral_buffer[67] = short_address;  //SJ4130912 - i=67
        ggeneral_buffer[68] = 0x00;  //SJ4130912 - i=68
    #endif
        ggeneral_buffer[69] = device_type;//0x00;  //SJ4130912 - i=69
        i = 70;  //SJ4130912 -
        break;
  #endif

  #if 1  //SJ4130912 - Used to return random address to user
    //else if (response_type == 194)  //SJ4130912 - #define QUERY_RANDOM_ADDR_H 194 in command.h
      case  13:  //SJ4131212 - #define AZ_SWITCH_IDENTITY 0x0D in command.h
      case 194:  //SJ4130912 - #define QUERY_RANDOM_ADDR_H 194 in command.h
      //{
        ggeneral_buffer[14] = 0x00;	//payload length i=14
        ggeneral_buffer[15] = 0x16;	//SJ4130912 - equiv 18 i=15

	    ggeneral_buffer[54] = 0x00;  //length in hex i=54
        ggeneral_buffer[55] = 0x16;  //SJ4130912 - THIS NEED TO CHANGE. Reflect the lenght of UDP packet i=55

        //ggeneral_buffer[58] = 0x08;	//SJ4130912 - THIS NEED TO CHANGE. Reflect the lenght of data to send 

        //ggeneral_buffer[62] = (gstate_var.Room_ID & 0xFF00) >> 8;//0x00;  //SJ1101212 - Room ID (MSB) i=62
        //ggeneral_buffer[63] = (gstate_var.Room_ID & 0x00FF);//0x00;  //SJ1101212 - Room ID (LSB) i=63
//SJ2220113 - SJEXT_ADDR: Not used, so unchange
        ggeneral_buffer[64] = 0xFF;//0x00;  //SJ1101212 - short address (MSB) i=64
        ggeneral_buffer[65] = 0xFF;//0x01;//short_address;  //SJ4130912 - Dali short address i=65
        ggeneral_buffer[66] = 0x0D;
        if (response_type == 194)
            ggeneral_buffer[66] = 0x0C;//0xC2;           //SJ4130912 - #define QUERY_RANDOM_ADDR_H 194 defined in command.h i=66

        ggeneral_buffer[67] = random_address_byte_h;  //SJ4130912 - i=67
        ggeneral_buffer[68] = random_address_byte_m;  //SJ4130912 - i=68
        ggeneral_buffer[69] = random_address_byte_l;  //SJ4130912 - i=69
        ggeneral_buffer[70] = device_type;  //SJ1101212 - SJTODO: used device type global var
        i = 71;  //SJ4130912 - Padding
        break;
      //}
  #endif

  #if 0  //SJ1170912 - Used to return grouping to user
//#define GROUPING_QUERY          6   //SJ1170912 - use the macro defined in command.h
      case 192:  //SJ1170912 - #define QUERY_GROUPS_0_7 192 in command.h
        i = 66;
        break;
  #endif

  #if 0  //SJ1170912 - Used to send sensor packet to GUI
      case SENSOR_DETECTED:  //#define SENSOR_DETECTED 7
        i = 65;  //SJ2180912 - Padding
        break;
  #endif

  #if 0  //SJ4041012 - Test broadcast from service node
      case BROADCAST_FROM_SN:  //#define BROADCAST_FROM_SN 8 in command.h
        i = 64;  //SJ2180912 - Padding
        break;
  #endif
    }  //SJ4131212 - switch (response_type) { ... }
//--- SJ4131212 - End of switch ---

    //i = 64;
    //k = 60;  //i - 4;

    //if ((i % 2) == 1)  //SJ3010812 - Padding required
    if ((i % 2))  //SJ3010812 - Padding required
    {
        ggeneral_buffer[i++] = 0x00;
        k = i - 5;  //SJ3010812 - Substract the first four bytes and padding byte.
    }
    else
        k = i - 4;  //SJ3010812 - Substract the first four bytes.

    ggeneral_buffer[2] = (k & 0x00FF);  //SJ3010812 - Msg payload length LSB; Total payload length=64
    ggeneral_buffer[3] = (k >> 8);  

