Suilarso/Aztech/MSP430G2553_PLC_iSW_Light/PLC_iSW_light.c
  #if 1  //SJ1101212 - If command if 94, then generate delay.
    if (response_type == 194)
    {
    //gstate_var.general_delay = 16;  //SJ4160812 - 800 msec
    gstate_var.general_delay = gstate_var.DALI_response;
    while (gstate_var.general_delay) ;
    }
  #endif

//SJ3130313    temp_msg_type = ggeneral_buffer[MSG_HEADER_TYPE];

    //SJ3010812 - Transmit packet to PLC device
    for (j=0; j<i; j++)
    {
        while (!(IFG2 & UCA0TXIFG));  // USCI_A0 TX buffer ready?
        UCA0TXBUF = ggeneral_buffer[j];  //0xA5
    }

    gstate_var.UART_Rx_State = UART_STANDBY;  //SJ1300712 - New method 
    gstate_var.UART_Rx_duration = TIMER_2_SECONDS;

    while (gstate_var.UART_Rx_duration)  //SJ3180712 - Wait for 2 seconds for UART_Rx to complete
    {
        if (gstate_var.UART_Rx_State == UART_PROCESSING)  //SJ1300712 - New method
        {

//SJ3130313            temp = (ggeneral_buffer[MESSAGE_HEADER_LEN+1] << 8) + ggeneral_buffer[MESSAGE_HEADER_LEN];

            //SJ3180712 - If msg type return from PLC device does not match the msg type sent by host, 
            //SJ3180712 - or reply status not equal 0x0000, raise error flag
//SJ3130313            if ((ggeneral_buffer[MSG_HEADER_TYPE] == temp_msg_type) && (temp == MSG_REQUEST_OK))
//SJ3130313            {
                //ret_flag = SJ_PASS;
//SJ3130313                ;
//SJ3130313            }

            //gstate_var.UART_Rx_ndx = MESSAGE_HEADER_LEN+1;  //SJ3180712 - Prevent UART_Rx ISR from setting UART_Rx_COMPLETE
            gstate_var.UART_Rx_duration = 0;
            gstate_var.UART_Rx_State = UART_STANDBY;  //SJ1100912 - 
#ifdef UART_ISSUE
//SJ4180713 - SJTO_TRY: Re-activate UART interrupt enable
UC0IE |= UCA0RXIE;
#endif
        }
    }

    //SJ1110313 - Added to ensure UART state change when there is no response
//SJ4180713 - Maybe below comparison condition should change to != 0
    //if (gstate_var.UART_Rx_State == UART_PROCESSING)  //SJ4180713 - ORG
    if (gstate_var.UART_Rx_State != UART_STANDBY)  //SJ4180713 - Replaced.
        gstate_var.UART_Rx_State = UART_STANDBY;  //SJ1100912 -

  #ifdef RED_N_GREEN_LED
    //SJ2091012 - Stop blinking
    gstate_var.general_ctrl_flag &= GRN_LED_BLINK_OFF;
    //gstate_var.green_led_timer = 0;  //SJ3191212 - ORG
    gstate_var.led_blink_freq = 0;
    P1OUT |= ON_GREEN_LED;  //SJ4061212 - Ensure green LED is on in the event of out of sync
  #endif

}  //SJ3010812 - End of AZ_DALI_Response()


#if 0  //SJ3010812 - Don't delete first
//SJ4120712 - This routine pumps data out via UART transmit channel.
char UART_TX_A0_Routine()
{
    //while (UC0IFG & UCA0TXIFG)  //SJ2240810 - ORG
    while (!(IFG2 & UCA0TXIFG));  // USCI_A0 TX buffer ready?
    UCA0TXBUF = 0xAA;//gstate_var.timer_ndx;

    return (0xFF);

}  //SJ4120712 - End of UART_TX_A0_Routine() routine
#endif


//--- End of file (PLC_Lite.c) --------------------------------------------------------------------

